app/controllers/movies_controller.rb

  def index
    sort = params[:sort]
    @movies = Movie.all
---
SELECT "movies".* FROM "movies" ORDER BY release_date