app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG') ORDER BY release_date
---
  def index
    sort = params[:sort] || session[:sort]
    case sort
      when 'title'
        ordering, @title_header = {:order => :title}, 'active'
      when 'release_date'
        ordering, @release_date_header = {:order => :release_date}, 'active'
    end
    @all_ratings = ['G', 'PG', 'PG-13', 'R']
    @selected_ratings = params[:ratings] || session[:ratings] || {}

    if params[:sort] != session[:sort]
      session[:sort] = sort
      redirect_to :sort => sort, :ratings => @selected_ratings and return
    end

    if params[:ratings] != session[:ratings] and @selected_ratings != {}
      session[:sort] = sort
      session[:ratings] = @selected_ratings
      redirect_to :sort => sort, :ratings => @selected_ratings and return
    end
    @movies = Movie.find_all_by_rating(@selected_ratings.keys, ordering)